ERP DEV.WMS/src/InformationRegisters/ОчередьПечати/ОчередьПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПечати</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПутьКПринтеру</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Распечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.вмс_НастройкиОператора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ОператорыПечатиАдресныхДокументов/вмс_ОператорыПечатиАдресныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ОператорыПечатиАдресныхДокументов</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/ТипыПринтеров/ТипыПринтеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПринтеров</name>
  <enumValues>
    <name>ЛокальныйПринтер</name>
  </enumValues>
  <enumValues>
    <name>БеспроводнойПринтер</name>
  </enumValues>
  <enumValues>
    <name>СерверныйПринтер</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Принтеры/вмс_Принтеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Принтеры</name>
  <attributes>
    <name>ТипПринтера</name>
    <type>
      <types>EnumRef.ТипыПринтеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматПечати</name>
    <type>
      <types>EnumRef.ФорматПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПринтеру</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЭтикетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЭтикетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьСервернаяКомпонентаПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_Печать/Module.bsl
#Область API 

// 3.2.4
Функция СформироватьПечатнуюФормуСерии(Серия, КоличествоКопий = 1) Экспорт
	Возврат СформироватьТабличныйДокументЭтикеткиСерии(Серия);
КонецФункции

// 3.2.4
Функция СформироватьПечатнуюФормуКонтейнеров(МассивКонтейнеров, КоличествоКопий = 1) Экспорт
	
	ТабличныйДокумент = НовыйТабличныйДокумент(); 
	
	ПоШаблону = Новый Массив;
	Для каждого Контейнер Из МассивКонтейнеров  Цикл
		Если Контейнер.ТипТары.ИспользоватьВнешнююПечатнуюФорму = Истина Тогда 
			Если МассивКонтейнеров.Найти(Контейнер)= 0 ИЛИ Контейнер.ТипТары <> МассивКонтейнеров[?(МассивКонтейнеров.Найти(Контейнер)= 0,0,(МассивКонтейнеров.Найти(Контейнер)-1))].ТипТары Тогда 
				ПФ = Контейнер.ТипТары.ВнешняяПечатнаяФорма.Получить(); 
				Если ПФ <> Неопределено Тогда
					Адрес = ПоместитьВоВременноеХранилище(ПФ.ФайлПФ);
					ИмяОбработки = ВнешниеОбработки.Подключить(Адрес, , Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
					МенеджерОбработки = ВнешниеОбработки.Создать(ИмяОбработки);
				КонецЕсли;
			КонецЕсли; 
			Попытка
				МенеджерОбработки.СформироватьЭтикетку(Контейнер, ТабличныйДокумент, КоличествоКопий);
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				ЗаписьЖурналаРегистрации("AS:WMS", УровеньЖурналаРегистрации.Ошибка, ,, ТекстОшибки);
			КонецПопытки;			
		Иначе
			ПоШаблону.Добавить(Контейнер);	
		КонецЕсли	
	КонецЦикла;
	
	Если ПоШаблону.Количество() <> 0 Тогда 
		СформироватьТабличныйДокументЭтикеткиКонтейнеровПоШаблону(ПоШаблону,КоличествоКопий,ТабличныйДокумент)
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// 3.2.4
Функция СформироватьПечатнуюФормуЭтикеткиТовара(ДанныеТовара, КоличествоКопий = 1) Экспорт
	
	Возврат вмс_АдаптацияКонфигураций.ПечатьЭтикеткиТовара(ДанныеТовара)
		
КонецФункции

// 3.2.4
Функция ДобавитьДокументКПечатиЧерезРегистр(ТабличныйДокумент, ВыбранныйПринтер) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОчередьПечати.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.ИмяКомпьютера.Установить(ВыбранныйПринтер.ИмяКомпьютера);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить(); 
	Запись.Период = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(Запись, ВыбранныйПринтер);
	Запись.НомерДокумента = НаборЗаписей.Количество();
	Запись.Хранилище = Новый ХранилищеЗначения(ТабличныйДокумент);
	Запись.Оператор = Неопределено;
	
	НаборЗаписей.Записать();
	
КонецФункции

// 3.2.4
Функция ВыполнитьПечатьЧерезКомпоненту(ТабличныйДокумент, ВыбранныйПринтер, ЖдатьЗавершения=Ложь) Экспорт
	
	Возврат вмс_ПечатьКлиентСервер.ВыполнитьПечатьЧерезКомпоненту(ТабличныйДокумент, ВыбранныйПринтер, ЖдатьЗавершения);
		
КонецФункции

Функция УстановитьКомпонентуСетевойПечати() Экспорт
	
	Возврат вмс_ПечатьКлиентСервер.УстановитьКомпонентуСетевойПечати();
	
КонецФункции

Функция ПолучитьДанныеПринтера(Принтер) Экспорт
	ДанныеПринтера = Новый Структура;

	Для Каждого ИмяПоля Из ПолучитьИменаПолейНастроекПринтера() Цикл
		ДанныеПринтера.Вставить(ИмяПоля, Принтер[ИмяПоля]);
	КонецЦикла;

	Возврат ДанныеПринтера;
КонецФункции

// Используется для формирования задания на печать через сервер печати
//
// Параметры:
//  ДанныеПечати - Структура	 - содержит входные данные для печати:
//     * ПараметрыПечати - Структура - содержит параметры печати
//     * МассивЭлементов - Массив - контейнеры, которые нужно напечатать
//     * КоличествоЭкземпляров - Число - сколько этикеток одного контейнера печатать
// Возвращаемое значение:
// Структура:
// 
//     * Ошибка - Булево - признак ошибки при отправке задания
//     * ТекстОшибки - Строка - поясняющий к ошибке комментарий
//
Функция ПечатьКонтейнераВИС(ДанныеПечати, Оператор = Неопределено) Экспорт 
	
	Ответ = Новый Структура("Ошибка, ТекстОшибки",Ложь,"Гуд ньюс");
	
	// -// Определение параметров печати //-//
	
	Принтер = Неопределено;
	ПараметрыПечати = Неопределено;
	Если ДанныеПечати.Свойство("ПараметрыПечати") Тогда
		ДанныеПечати.ПараметрыПечати.Свойство("Принтер", Принтер);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Принтер) Тогда
		ПараметрыПечати = ПолучитьПараметрыПринтера(Принтер);		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ПараметрыПечати) Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Не удалось получить параметры печати";
		Возврат Ответ;	
	КонецЕсли; 
	
	// -// Формирование этикетки //-//
	
	МассивЭлементов = Неопределено;
	Если НЕ ДанныеПечати.Свойство("МассивЭлементов", МассивЭлементов) Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Отсутствует ключ МассивЭлементов";
		Возврат Ответ;
	КонецЕсли;
	
	КоличествоЭкземпляров = Неопределено;
	Если НЕ ДанныеПечати.Свойство("КоличествоЭкземпляров", КоличествоЭкземпляров) Тогда
		КоличествоЭкземпляров = 1;	
	КонецЕсли;
	
	ТабДокЭтикетки = СформироватьТабличныйДокументЭтикеткиКонтейнеров(МассивЭлементов, КоличествоЭкземпляров);
	
	Если ТабДокЭтикетки = Неопределено Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Не удалось сформировать табличный документ";
		Возврат Ответ;	
	КонецЕсли;
	
	// -// Отправка задания на печать //-//
	
	Возврат ОтправкаЗаданияНаПечатьВИС(Ответ, ТабДокЭтикетки,,ПараметрыПечати);

КонецФункции

// Возвращает по массиву контейнеров табличный документ с этикетками. Используется при непосредственной печати с ТСД и
// как метод печати для сервера печати Во время печати определяет, печатать внешнюю печатную форму из контейнера или по
// стандартному шаблону, в зависимости от типа контейнера
//
// Параметры:
//  МассивКонтейнеров	 - Массив	 - контейнеры, для которых печатаются этикетки
//  КоличествоКопий		 - Число	 - сколько раз печатать каждую этикетку
// 
// Возвращаемое значение:
// ТабличныйДокумент  - табличный документ с этикетками
//
Функция СформироватьТабличныйДокументЭтикеткиКонтейнеров(МассивКонтейнеров, КоличествоКопий = 1) Экспорт
	
	ТабличныйДокумент = НовыйТабличныйДокумент(); 
	
	ПоШаблону = Новый Массив;
	Для каждого Контейнер Из МассивКонтейнеров  Цикл
		Если Контейнер.ТипТары.ИспользоватьВнешнююПечатнуюФорму = Истина Тогда 
			Если МассивКонтейнеров.Найти(Контейнер)= 0 ИЛИ Контейнер.ТипТары <> МассивКонтейнеров[?(МассивКонтейнеров.Найти(Контейнер)= 0,0,(МассивКонтейнеров.Найти(Контейнер)-1))].ТипТары Тогда 
				ПФ = Контейнер.ТипТары.ВнешняяПечатнаяФорма.Получить(); 
				Если ПФ <> Неопределено Тогда
					Адрес = ПоместитьВоВременноеХранилище(ПФ.ФайлПФ);
					ИмяОбработки = ВнешниеОбработки.Подключить(Адрес, , Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
					МенеджерОбработки = ВнешниеОбработки.Создать(ИмяОбработки);
				КонецЕсли;
			КонецЕсли; 
			Попытка
				МенеджерОбработки.СформироватьЭтикетку(Контейнер, ТабличныйДокумент, КоличествоКопий);
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				ЗаписьЖурналаРегистрации("AS:WMS", УровеньЖурналаРегистрации.Ошибка, ,, ТекстОшибки);
			КонецПопытки;			
		Иначе
			ПоШаблону.Добавить(Контейнер);	
		КонецЕсли	
	КонецЦикла;
	
	Если ПоШаблону.Количество() <> 0 Тогда 
		СформироватьТабличныйДокументЭтикеткиКонтейнеровПоШаблону(ПоШаблону,КоличествоКопий,ТабличныйДокумент)
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Используется для формирования задания на печать серии через сервер печати
//
// Параметры:
//  ДанныеПечати - Структура	 - содержит входные данные для печати:
//     * ПараметрыПечати - Структура - содержит параметры печати
//     * РеквизитыСерии - Структура - параметры серии для печати: ВАЖНО, должен быть заполнен хоть 1 параметр:
//         * Номер - Строка , Неопределено- номер серии  
//         * ГоденДо - Дата ,Неопределено - окончание срока годности
//         * ДатаПроизводства - Дата ,Неопределено - дата производства серии
//     * КоличествоЭкземпляров - Число - сколько этикеток серии печатать
// Возвращаемое значение:
// Структура:
// 
//     * Ошибка - Булево - признак ошибки при отправке задания
//     * ТекстОшибки - Строка - поясняющий к ошибке комментарий
//
Функция ПечатьСерийнойЭтикеткиВИС(ДанныеПечати, Оператор = Неопределено) Экспорт

	Ответ = Новый Структура("Ошибка, ТекстОшибки",Ложь,"Гуд ньюс");
	
	// -// Определение параметров печати //-//
	
	Принтер = Неопределено;
	ПараметрыПечати = Неопределено;
	Если ДанныеПечати.Свойство("ПараметрыПечати") Тогда
		ДанныеПечати.ПараметрыПечати.Свойство("Принтер", Принтер);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Принтер) Тогда
		ПараметрыПечати = ПолучитьПараметрыПринтера(Принтер);		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ПараметрыПечати) Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Не удалось получить параметры печати";
		Возврат Ответ;	
	КонецЕсли;
	
	// -// Формирование этикетки //-//
	
	РеквизитыПечати = Неопределено;
	Если НЕ ДанныеПечати.Свойство("РеквизитыПечати", РеквизитыПечати) Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Отсутствует ключ РеквизитыПечати";
		Возврат Ответ;
	КонецЕсли;
	
	КоличествоЭкземпляров = Неопределено;
	Если НЕ ДанныеПечати.Свойство("КоличествоЭкземпляров", КоличествоЭкземпляров) Тогда
		КоличествоЭкземпляров = 1;
	КонецЕсли;
	
	ТабДокЭтикетки = СформироватьТабличныйДокументЭтикеткиСерии(РеквизитыПечати, КоличествоЭкземпляров, Принтер);
	
	Если ТабДокЭтикетки = Неопределено Тогда
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Не удалось сформировать табличный документ";
		Возврат Ответ;	
	КонецЕсли; 
	
	// -// Отправка задания на печать //-//
	
	Возврат ОтправкаЗаданияНаПечатьВИС(Ответ, ТабДокЭтикетки,,ПараметрыПечати);	
	
КонецФункции

// Возвращает по реквизитам серии табличный документ с этикетками. Используется при непосредственной печати с ТСД и как
// метод печати для сервера печати Во время печати определяет, печатать внешнюю печатную форму из контейнера или по
// стандартному шаблону, в зависимости от типа контейнера
//
// Параметры:
//  РеквизитыСерии - Структура - параметры серии для печати: ВАЖНО, должен быть заполнен хоть 1 параметр:
//         * Номер - Строка , Неопределено- номер серии  
//         * ГоденДо - Дата ,Неопределено - окончание срока годности
//         * ДатаПроизводства - Дата ,Неопределено - дата производства серии
//  КоличествоКопий		 - Число	 - сколько раз печатать каждую этикетку
// 
// Возвращаемое значение:
// ТабличныйДокумент  - табличный документ с этикетками
//
Функция СформироватьТабличныйДокументЭтикеткиСерии(РеквизитыСерии, КоличествоКопий = 1, Принтер=Неопределено) Экспорт  
	
	ТабличныйДокумент = НовыйТабличныйДокумент(); 
	
	ПоШаблону = Новый Массив;
	Если Ложь Тогда  //Заглушка для печати через внешнюю обработку  
		
		// Кулалаев Е.С + 31.05.2024 17:56:48
		// Рефакторинг. вмс_Печать на вмс_Печать
		
		МенеджерОбработки = вмс_ПечатьПереопределяемыйВызовСервера.СформироватьТабличныйДокументЭтикеткиСерии(РеквизитыСерии, КоличествоКопий);
		
		Попытка
			МенеджерОбработки.СформироватьЭтикетку(РеквизитыСерии, ТабличныйДокумент, КоличествоКопий);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ЗаписьЖурналаРегистрации("AS:WMS", УровеньЖурналаРегистрации.Ошибка, ,, ТекстОшибки);
		КонецПопытки;
		
	Иначе
		ПоШаблону.Добавить(РеквизитыСерии);	
	КонецЕсли;	
	
	Если ПоШаблону.Количество() <> 0 Тогда			
		СформироватьТабличныйДокументЭтикеткиСерииПоШаблону(ПоШаблону, КоличествоКопий, ТабличныйДокумент, Принтер); // ТУ_Самойленко 30.08.23		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьТоварнойЭтикеткиВИС(ДанныеПечати, Оператор = Неопределено) Экспорт
	
	Ответ = Новый Структура("Ошибка, ТекстОшибки",Ложь,"Гуд ньюс");
	
	Попытка
		// -// Определение параметров печати //-//
		
		Принтер = Неопределено;
		ПараметрыПечати = Неопределено;
		Если ДанныеПечати.Свойство("ПараметрыПечати") Тогда
			ДанныеПечати.ПараметрыПечати.Свойство("Принтер", Принтер);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Принтер) Тогда
			ПараметрыПечати = ПолучитьПараметрыПринтера(Принтер);		
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ПараметрыПечати) Тогда
			Ответ.Ошибка = Истина;
			Ответ.ТекстОшибки = "Не удалось получить параметры печати";
			Возврат Ответ;	
		КонецЕсли;
		
		// -// Формирование этикетки //-//
		
		РеквизитыПечати = Неопределено;
		Если НЕ ДанныеПечати.Свойство("РеквизитыПечати", РеквизитыПечати) Тогда
			Ответ.Ошибка = Истина;
			Ответ.ТекстОшибки = "Отсутствует ключ РеквизитыПечати";
			Возврат Ответ;
		КонецЕсли;
		
		КоличествоЭкземпляров = Неопределено;
		Если ДанныеПечати.Свойство("КоличествоЭкземпляров", КоличествоЭкземпляров) Тогда
			РеквизитыПечати.Вставить("Количество", КоличествоЭкземпляров);
		Иначе
			Если НЕ РеквизитыПечати.Свойство("Количество") Тогда
				РеквизитыПечати.Вставить("Количество", 1);	
			КонецЕсли;
		КонецЕсли;
		
		ТабДокЭтикетки = вмс_АдаптацияКонфигураций.ПечатьЭтикеткиТовара(РеквизитыПечати);
		
		Если ТабДокЭтикетки = Неопределено Тогда
			Ответ.Ошибка = Истина;
			Ответ.ТекстОшибки = "Не удалось сформировать табличный документ";
			Возврат Ответ;	
		КонецЕсли; 
		
		// -// Отправка задания на печать //-//
		// ТУ_Прошин_13.05.24++
		// Добавил параметр Оператора
		Возврат ОтправкаЗаданияНаПечатьВИС(Ответ, ТабДокЭтикетки,Оператор,ПараметрыПечати);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = вмс_ОбщегоНазначенияВызовСервера.ТекстовоеПредставлениеОшибки(Инфо);
		Возврат Ответ;
	КонецПопытки;
КонецФункции

Функция СформироватьПечатнуюФорму(Объекты, ИмяМакета, ПараметрыПечати=Неопределено) Экспорт
	
	Перем Результат;
	
	Если ТипЗнч(Объекты) <> ТипЗнч("Массив") Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объекты);
	Иначе
		МассивОбъектов = Объекты;
	КонецЕсли;
	
	ИмяМенеджераПечати = МассивОбъектов[0].Метаданные().ПолноеИмя();
	
	Если ТипЗнч(ПараметрыПечати) <> Тип("Структура") Тогда
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	
	Результат = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, ИмяМакета, МассивОбъектов, ПараметрыПечати);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ИзображениеШтрихкода(ПараметрыШтрихкода) Экспорт
	
	// Кулалаев. TODO
	// Переход на строенную в расширение БСП.
	// Переделать на вмсб_ГенерацияШтрихкода, отвязавшисть от типовых подсистем.
	
	Картинка = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ГенерацияШтрихкода") Тогда 
		МенеджерПечати = ОбщегоНазначения.ОбщийМодуль("ГенерацияШтрихкода");
		РезультатОперации = МенеджерПечати.ИзображениеШтрихкода(ПараметрыШтрихкода);
		Если РезультатОперации.Результат Тогда
			Картинка = РезультатОперации.Картинка;
		Иначе
			Картинка = Неопределено;
		КонецЕсли;
	Иначе
		Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

// Автомасштаб = Истина. Все поля в ноль. Для этикеток, чтобы не было отступов.
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент - табличный документ для установки базовых параметров.
//
Процедура УстановитьБазовыеПараметрыТабличногоДокумента(ТабличныйДокумент) Экспорт 
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСнизу   = 0;
	ТабличныйДокумент.ПолеСлева   = 0;
	ТабличныйДокумент.ПолеСправа  = 0;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу  = 0;	
	
КонецПроцедуры

Функция ПолучитьСписокПринтеров() Экспорт 
	
	Возврат вмс_ПечатьКлиентСервер.ПолучитьСписокПринтеров();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из модуля приложения. Возвращает непечатанные данные.
//
// Параметры:
//  ИмяКомпьютера	 - Строка	 - имя локального компьютера, с которого происходит печать
// 
// Возвращаемое значение:
// Массив  - массив ненапечатанных данных.
//
Функция ОбработчикОжиданияСервераПечати(ИмяКомпьютера) Экспорт
	
	МассивДокументов = Новый Массив;
	
	НаборЗаписей = РегистрыСведений.ОчередьПечати.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.ИмяКомпьютера.Установить(ИмяКомпьютера); 
	НаборЗаписей.Отбор.Распечатано.Установить(Ложь);
	НаборЗаписей.Прочитать();  	
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		НачатьТранзакцию();	   
		
		МенеджерЗаписи = РегистрыСведений.ОчередьПечати.СоздатьМенеджерЗаписи();
		
		Для Каждого ТекЗапись Из НаборЗаписей Цикл
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Распечатано = Истина;
			МенеджерЗаписи.Записать();
		КонецЦикла;	
		
		ТаблицаПечати = НаборЗаписей.Выгрузить();		
		ТаблицаПечати.Сортировать("НомерДокумента");    
		
		Попытка
			
			Для каждого Строка Из ТаблицаПечати  Цикл 
													
				ТабличныйДокумент = Строка.Хранилище.Получить(); 
				Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
					Продолжить;	
				КонецЕсли;
				УстановитьБазовыеПараметрыТабличногоДокумента(ТабличныйДокумент);
				ТабличныйДокумент.ИмяПринтера = Строка.ПутьКПринтеру; 
				МассивДокументов.Добавить(ТабличныйДокумент);
								
			КонецЦикла;		
		
			ЗафиксироватьТранзакцию(); 
			Возврат МассивДокументов;
		Исключение    
			ОписаниеОшибки = ОписаниеОшибки();
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

// Возвращает Истина, если у пользователя есть право на работу с модулем, и он установлен как оператор печати (под его
// учеткой запускается мониторинг сервера печати) Используется для инициализации монитора сервера печати, и при
// определении необходимости добавить ШК склада в типовую печатную форму.
// 
// Возвращаемое значение:
// Булево  - значение права печати
//
Функция ЕстьПравоПечатиДокументовСклада() Экспорт 
	
	// ТУ_Мовчан 11.01.24
	Если НЕ вмс_РаботаСПользователямиСервер.ПроверитьПраваНаВМС() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.вмс_ОператорыПечатиАдресныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Заполнить(Неопределено);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь()); 
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() > 0;
	
КонецФункции

// Конструктор для параметра КоллекцияПечатныхФорм процедуры Печать.
//
// Возвращаемое значение:
//  ТаблицаЗначений - пустая коллекция печатных форм:
//   * ИмяМакета - Строка - идентификатор печатной формы;
//   * ИмяВРЕГ - Строка - идентификатор в верхнем регистре символов для быстрого поиска;
//   * СинонимМакета - Строка - представление печатной формы;
//   * ТабличныйДокумент - ТабличныйДокумент - печатная форма;
//   * Экземпляров - Число - количество копий, которое необходимо вывести на печать;
//   * Картинка - Картинка - (не используется);
//   * ПолныйПутьКМакету - Строка - используется для быстрого перехода к редактированию макета печатной формы;
//   * ИмяФайлаПечатнойФормы - Строка - имя файла;
//                           - Соответствие из КлючИЗначение - имена файлов для каждого объекта:
//                              ** Ключ - ЛюбаяСсылка - ссылка на объект печати;
//                              ** Значение - Строка - имя файла;
//   * ОфисныеДокументы - Соответствие из КлючИЗначение - коллекция печатных форм в формате офисных документов:
//                         ** Ключ - Строка - адрес во временном хранилище двоичных данных печатной формы;
//                         ** Значение - Строка - имя файла печатной формы.
//
Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы) Экспорт 
	
	// Кулалаев Е.С + 31.05.2024 17:56:48
	// Рефакторинг. вмс_ПечатьКлиентСервер на вмс_ПечатьКлиентСервер
	
	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из вмс_ПечатьКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;
	
КонецФункции

// Подготовить структуру параметров вывода для менеджера объекта формирующего печатные формы.
//
Функция ПодготовитьСтруктуруПараметровВывода() Экспорт
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("ЗаголовокФормы", "");
	ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно", Ложь); // не используется
	
	СтруктураПараметровПисьма = Новый Структура("Получатель,Тема,Текст", Неопределено, "", "");
	ПараметрыВывода.Вставить("ПараметрыОтправки", СтруктураПараметровПисьма);
	
	Возврат ПараметрыВывода;
	
КонецФункции

// Проверить, нужно ли печатать макет.
// Функция предназначена для использования только внутри процедуры Печать.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - служебный параметр, переданный в процедуру Печать;
//  ИмяМакета             - Строка          - имя проверяемого макета.
//
// Возвращаемое значение:
//  Булево - Истина, если макет надо печатать.
//
Функция НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Экспорт
	
	Возврат КоллекцияПечатныхФорм.Найти(ВРег(ИмяМакета), "ИмяВРЕГ") <> Неопределено;
	
КонецФункции

// Добавляет табличный документ в коллекцию печатных форм.
// Процедура предназначена для использования только внутри процедуры Печать.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - служебный параметр, переданный в процедуру Печать;
//  ИмяМакета             - Строка - имя макета;
//  СинонимМакета         - Строка - представление макета;
//  ТабличныйДокумент     - ТабличныйДокумент - печатная форма документа;
//  Картинка              - Картинка - пиктограмма печатной формы;
//  ПолныйПутьКМакету     - Строка - путь к макету в дереве метаданных, например
//                                   "Документ.СчетНаОплатуПокупателю.ПФ_MXL_СчетЗаказ".
//                                   Если не указывать этот параметр, то редактирование макета пользователем будет
//                                   недоступно в форме ПечатьДокументов.
//  ИмяФайлаПечатнойФормы - Строка - имя, используемое при сохранении печатной формы в файл;
//                        - Соответствие из КлючИЗначение:
//                           * Ключ     - ЛюбаяСсылка - ссылка на объект печати;
//                           * Значение - Строка - имя файла.
//
Процедура ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент,
	Картинка = Неопределено, ПолныйПутьКМакету = "", ИмяФайлаПечатнойФормы = Неопределено) Экспорт
	
	Если КоллекцияПечатныхФорм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег(ИмяМакета), "ИмяВРЕГ");
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
		ОписаниеПечатнойФормы.СинонимМакета = СинонимМакета;
		ОписаниеПечатнойФормы.Картинка = Картинка;
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = ПолныйПутьКМакету;
		ОписаниеПечатнойФормы.ИмяФайлаПечатнойФормы = ИмяФайлаПечатнойФормы;
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатную форму по внешнему источнику.
//
// Параметры:
//   ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - внешняя обработка.
//   ПараметрыИсточника            - Структура:
//       * ИдентификаторКоманды - Строка - список макетов, перечисленных через запятую.
//       * ОбъектыНазначения    - Массив
//   КоллекцияПечатныхФорм - см. описание процедуры Печать() в документации.
//   ОбъектыПечати         - СписокЗначений  - см. описание процедуры Печать() в документации.
//   ПараметрыВывода       - Структура       - см. описание процедуры Печать() в документации.
//   
Функция ПечатьПоВнешнемуИсточнику(ДополнительнаяОбработкаСсылка, ПараметрыИсточника, КоллекцияПечатныхФорм=Неопределено,
	ОбъектыПечати=Неопределено, ПараметрыВывода=Неопределено) Экспорт
	
	// ТУ_Кукушкин 31.05.2024 ++ Изменилось название модуля
	//МодульДополнительныеОтчетыИОбработки = Вычислить("вмс_ДополнительныеОтчетыИОбработки"); (закомментировал) 
	МодульДополнительныеОтчетыИОбработки = Вычислить("вмс_ДополнительныеОтчетыИОбработки"); 
	// // ТУ_Кукушкин 31.05.2024 --
	
	ВнешняяОбработкаОбъект = МодульДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ДополнительнаяОбработкаСсылка);
	Если ВнешняяОбработкаОбъект = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Внешняя обработка ""%1"" (тип ""%2"") не обслуживается.'"),
			Строка(ДополнительнаяОбработкаСсылка),
			Строка(ТипЗнч(ДополнительнаяОбработкаСсылка)));
	КонецЕсли;
	
	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм(ПараметрыИсточника.ИдентификаторКоманды);
	ПараметрыВывода = ПодготовитьСтруктуруПараметровВывода();
	ПараметрыВывода.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	Результат =
				ВнешняяОбработкаОбъект.Печать(
					ПараметрыИсточника.ОбъектыНазначения,
					КоллекцияПечатныхФорм,
					ОбъектыПечати,
					ПараметрыВывода);
	
	// Проверим, все ли макеты были сформированы.
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		Если ТабличныйДокумент = Неопределено Тогда
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В обработчике печати не был сформирован табличный документ для: %1'"),
				ПечатнаяФорма.ИмяМакета);
			ВызватьИсключение(ТекстСообщенияОбОшибке);
		КонецЕсли;
		
		Если ТипЗнч(ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.Экземпляров;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получаем настройки принтеров оператора в виде ТаблицыЗначений
Функция ПолучитьТаблицуНастроекПринтеров(Оператор=Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Оператор) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ИменаПолей = ПолучитьИменаПолейНастроекПринтера();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	вмс_НастройкиОператораПринтеры.ПоУмолчанию КАК ПоУмолчанию,
		|	вмс_НастройкиОператораПринтеры.Принтер КАК Принтер";
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		Запрос.Текст = Запрос.Текст + ",
		|	вмс_НастройкиОператораПринтеры.Принтер." + ИмяПоля + " КАК " + ИмяПоля;	
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Справочник.вмс_НастройкиОператора.Принтеры КАК вмс_НастройкиОператораПринтеры
		|ГДЕ
		|	вмс_НастройкиОператораПринтеры.Ссылка = &Оператор
		|	И вмс_НастройкиОператораПринтеры.Принтер.ПометкаУдаления = ЛОЖЬ
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ПоУмолчанию УБЫВ
		|";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получаем параметры конкретного принтера
Функция ПолучитьПараметрыПринтера(Принтер=Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Принтер) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ИменаПолей = ПолучитьИменаПолейНастроекПринтера();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вмс_Принтеры.Ссылка КАК Принтер";
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		Запрос.Текст = Запрос.Текст + ",
		|	вмс_Принтеры." + ИмяПоля + " КАК " + ИмяПоля;	
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	               |ИЗ
	               |	Справочник.вмс_Принтеры КАК вмс_Принтеры
	               |ГДЕ
	               |	вмс_Принтеры.Ссылка = &Принтер";
	Запрос.УстановитьПараметр("Принтер", Принтер);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат[0];
	Иначе	
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

// Получаем массив имен реквизитов справочника вмс_Принтер
Функция ПолучитьИменаПолейНастроекПринтера() Экспорт
	
	Результат = Новый Массив;
	
	Для каждого Реквизит Из Метаданные.Справочники.вмс_Принтеры.Реквизиты Цикл
    	Результат.Добавить(Реквизит.Имя);
	КонецЦикла;	
		
	Возврат Результат;
	
КонецФункции

// Программно меняем принтер по умолчанию для оператора
Функция СменитьПринтерПоУмолчаниюОператору(Оператор=Неопределено, ПринтерПоУмолчанию=Неопределено, ФорматПечати=Неопределено) Экспорт

	Если ЗначениеЗаполнено(Оператор) Тогда
		
		Если ТипЗнч(Оператор) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НастройкаОператора = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор", Оператор);	
		Иначе	
			НастройкаОператора = Оператор;	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НастройкаОператора) Тогда
			НастройкаОператора.ПолучитьОбъект().СменитьПринтерПоУмолчанию(ПринтерПоУмолчанию, ФорматПечати);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#Область Адаптация 

// Вызывается из АдаптацияКонфигураций.Получаем индивидуальный или общий шаблон этикетки, в зависимости от параметров номенклатуры
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура 	 -номенклатура, для которой нужно вернуть шаблон этикетки.
//													В зависимости от использования индивидуального или общего шаблона возвращает из элемента или из вида номенклатуры
// 
// Возвращаемое значение:
// СправочникСсылка.ШаблоныЭтикетокИЦенников - ссылка на шаблон этикетки
//
Функция ПолучитьШаблонЭтикетки(Номенклатура=Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если Номенклатура.ИспользоватьИндивидуальныйШаблонЭтикетки Тогда
			Возврат Номенклатура.ШаблонЭтикетки;
		Иначе
			Возврат Номенклатура.ВидНоменклатуры.ШаблонЭтикетки;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

// Вызывается из АдаптацияКонфигураций.Получаем индивидуальный или общий шаблон Ценника, в зависимости от параметров номенклатуры
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура 	 -номенклатура, для которой нужно вернуть шаблон ценника.
//													В зависимости от использования индивидуального или общего шаблона возвращает из элемента или из вида номенклатуры
// 
// Возвращаемое значение:
// СправочникСсылка.ШаблоныЭтикетокИЦенников - ссылка на шаблон ценника
//
Функция ПолучитьШаблонЦенника(Номенклатура=Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если Номенклатура.ИспользоватьИндивидуальныйШаблонЦенника Тогда
			Возврат Номенклатура.ШаблонЦенника;
		Иначе
			Возврат Номенклатура.ВидНоменклатуры.ШаблонЦенника;		
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает табличный документ, с автомасштабом по ширине и без полей.
// 
// Возвращаемое значение:
// ТабличныйДокумент -ТабличныйДокумент с автомасштабом по ширине и без полей 
//
Функция НовыйТабличныйДокумент()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	УстановитьБазовыеПараметрыТабличногоДокумента(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
		
КонецФункции  

Функция ОтправкаЗаданияНаПечатьВИС(Ответ, ТабличныйДокумент, Оператор=Неопределено, ПараметрыПечати=Неопределено) Экспорт
	
	МассивТабДоков = Новый Массив;
	МассивТабДоков.Добавить(ТабличныйДокумент);
	ИнформацияПоИсполнению = ДобавитьДокументКПечатиНаСервер(МассивТабДоков,Оператор,ПараметрыПечати);
	
	Если ЗначениеЗаполнено(ИнформацияПоИсполнению) Тогда
		Ответ.Ошибка = НЕ ИнформацияПоИсполнению.Результат;
		Ответ.ТекстОшибки = ИнформацияПоИсполнению.ОтветСервераПечати;
		Возврат Ответ;	
	Иначе
		Ответ.Ошибка = Истина;
		Ответ.ТекстОшибки = "Не удалось отправить документ на сервер печати";
		Возврат Ответ;	
	КонецЕсли;
	
КонецФункции 

Функция ДобавитьДокументКПечатиНаСервер(МассивТабличныхДокументов, Оператор = Неопределено, ПараметрыПечати = Неопределено) Экспорт
	
	ПринтерНаПечать = Неопределено; 
	ИмяКомпьютера = Неопределено;
	ПутьКПринтеру = Неопределено;
	
	// ТУ_Самойленко 10.08.23 ++ 
	Если Не ЗначениеЗаполнено(ПараметрыПечати) Тогда 
		
		ТаблицаНастроекПечати = ПолучитьТаблицуНастроекПринтеров(Оператор);  
		
		Если ЗначениеЗаполнено(ТаблицаНастроекПечати) Тогда
			
			// Сначала ищем локальный принтер по умолчанию
			// Если не нашли, ищем первый локальный принтер
			МассивЛокальныхПринтеровПоУмолчанию = ТаблицаНастроекПечати.НайтиСтроки(Новый Структура("ТипПринтера,ПоУмолчанию",Перечисления.ТипыПринтеров.ЛокальныйПринтер,Истина));
			
			Если МассивЛокальныхПринтеровПоУмолчанию.Количество() <> 0 Тогда
				ПринтерНаПечать = МассивЛокальныхПринтеровПоУмолчанию[0]; 
			Иначе
				Для каждого СтрокаПринтер Из ТаблицаНастроекПечати Цикл			
					Если СтрокаПринтер.ТипПринтера = Перечисления.ТипыПринтеров.ЛокальныйПринтер Тогда
						ПринтерНаПечать = СтрокаПринтер;
						Прервать;
					КонецЕсли;			
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПринтерНаПечать = Неопределено Тогда
			Возврат Новый Структура("Результат,ОтветСервераПечати",Ложь,"Не удалось определить принтер для текущего оператора");	
		КонецЕсли;
		
	Иначе
		
		ПринтерНаПечать = ПараметрыПечати;
		
	КонецЕсли;
		
	// ТУ_Самойленко 10.08.23 --
	
	Для каждого ТабличныйДокумент Из МассивТабличныхДокументов  Цикл 
		
		НаборЗаписей = РегистрыСведений.ОчередьПечати.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяКомпьютера.Установить(ПринтерНаПечать.ИмяКомпьютера);
		НаборЗаписей.Прочитать();
		
		Запись = НаборЗаписей.Добавить(); 
		Запись.Период = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(Запись,ПринтерНаПечать);
		Запись.НомерДокумента = НаборЗаписей.Количество();
		Запись.Хранилище = Новый ХранилищеЗначения(ТабличныйДокумент); 
		
		Если ТипЗнч(Оператор)=Тип("СправочникСсылка.вмс_НастройкиОператора") Тогда
			Запись.Оператор = Оператор;
		Иначе
			// ТУ_Прошин_06.05.24++
			НайденныйОператор = Справочники.вмс_НастройкиОператора.НайтиПоРеквизиту("Оператор", Оператор);
			Если ЗначениеЗаполнено(НайденныйОператор) Тогда	
				Запись.Оператор = НайденныйОператор;
			КонецЕсли;  
			// ТУ_Прошин_06.05.24--
		КонецЕсли;
				
		НаборЗаписей.Записать();  
		
		ИмяКомпьютера = ПринтерНаПечать.ИмяКомпьютера; 
		ПутьКПринтеру = ПринтерНаПечать.ПутьКПринтеру;
	КонецЦикла;	
	
	Возврат Новый Структура("Результат,ОтветСервераПечати",Истина,"Отправлено на " + ИмяКомпьютера + "\" + ПутьКПринтеру);
	
КонецФункции

Функция СформироватьТабличныйДокументЭтикеткиКонтейнеровПоШаблону(МассивКонтейнеров, КоличествоКопий = 1, ТабличныйДокумент)
	ТаблицаПечати = Новый ТаблицаЗначений;
	ТаблицаПечати.Колонки.Добавить("Контейнер");
	ТаблицаПечати.Колонки.Добавить("Шаблон");	
	
	Для каждого Контейнер Из МассивКонтейнеров  Цикл	
		нСтрока = ТаблицаПечати.Добавить(); 
		нСтрока.Контейнер = Контейнер;
		нСтрока.Шаблон = Контейнер.ТипТары.ШаблонЭтикетки;		
	КонецЦикла;  
	
	ТаблицаШаблонов = ТаблицаПечати.Скопировать(,"Шаблон");
	ТаблицаШаблонов.Свернуть("Шаблон");
	
	Для каждого пСтрока Из ТаблицаШаблонов  Цикл		
		МассивКонтейнеровШаблона = ТаблицаПечати.НайтиСтроки(Новый Структура("Шаблон",пСтрока.Шаблон));	
		
		Для каждого СтрокаКонтейнер Из МассивКонтейнеровШаблона  Цикл
			
			Контейнер = СтрокаКонтейнер.Контейнер; 		
			СтруктураШаблона = пСтрока.Шаблон.ШаблонЭтикетки.Получить();
			
			Область = СтруктураШаблона.МакетЭтикетки;
			ПараметрыМакета = Новый Структура("",);
			
			Для каждого КлючЗначение Из СтруктураШаблона.ПараметрыШаблона Цикл 
				
				Если СтруктураШаблона.Свойство("ОбработчикиПараметров") Тогда
					Обработчики = СтруктураШаблона.ОбработчикиПараметров;
					Обработчик = Обработчики[КлючЗначение.Ключ];
					Если ЗначениеЗаполнено(Обработчик) Тогда 
						
						Обработчик = СтрЗаменить(Обработчик,"%Параметр%",Строка(Контейнер[КлючЗначение.Ключ])); 
						Попытка
							ЗначениеПараметра = Вычислить(Обработчик);	
						Исключение
							ЗначениеПараметра = Строка(Контейнер[КлючЗначение.Ключ]);
						КонецПопытки;
						
					Иначе
						ЗначениеПараметра = Строка(Контейнер[КлючЗначение.Ключ]);						
					КонецЕсли;  
				Иначе
					ЗначениеПараметра = Строка(Контейнер[КлючЗначение.Ключ]);			
				КонецЕсли;
				ПараметрыМакета.Вставить(КлючЗначение.Значение,ЗначениеПараметра);	
			КонецЦикла;
			
			Область.Параметры.Заполнить(ПараметрыМакета);
			
			Для каждого Рисунок Из Область.Рисунки Цикл
				
				Если СтрНайти(Рисунок.Имя, "Штрихкод") = 1 Тогда
					
					ЗначениеШтрихкода = Контейнер.Штрихкод;
					Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
						ЗначениеШтрихкодаДляКомпоненты = ЗначениеШтрихкода;
						
						Если СтруктураШаблона.Свойство("УровеньЧеткости") Тогда
							УровеньЧеткости = СтруктураШаблона.УровеньЧеткости;
						Иначе
							УровеньЧеткости = 1;
						КонецЕсли;  
						
						Эталон = ПолучитьОбщийМакет("Эталон");
						
						КоличествоМиллиметровВПикселеВысота = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
						КоличествоМиллиметровВПикселеШирина = Эталон.Рисунки.Квадрат100Пикселей.Ширина / 100;
						
						ПараметрыШтрихкода = Новый Структура;
						ПараметрыШтрихкода.Вставить("Ширина",           Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселеШирина) * УровеньЧеткости);
						ПараметрыШтрихкода.Вставить("Высота",           Окр(Рисунок.Высота / КоличествоМиллиметровВПикселеВысота) * УровеньЧеткости);
						ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ЗначениеШтрихкодаДляКомпоненты));
						ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
						ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Ложь);  
						
						Если СтруктураШаблона.Свойство("ТипКода") Тогда
							ПараметрыШтрихкода.Вставить("ТипКода", СтруктураШаблона.ТипКода);
						Иначе
							ПараметрыШтрихкода.Вставить("ТипКода", 16);
						КонецЕсли;
						
						Если СтруктураШаблона.Свойство("GS1DatabarКоличествоСтрок") Тогда
							ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", СтруктураШаблона.GS1DatabarКоличествоСтрок);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("ТипШрифта") Тогда
							ПараметрыШтрихкода.Вставить("ТипШрифта", СтруктураШаблона.МонохромныйШрифт);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("УголПоворота") Тогда
							ПараметрыШтрихкода.Вставить("УголПоворота", СтруктураШаблона.УголПоворота);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("МонохромныйШрифт") Тогда
							ПараметрыШтрихкода.Вставить("МонохромныйШрифт", СтруктураШаблона.МонохромныйШрифт);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("Масштабировать") Тогда
							ПараметрыШтрихкода.Вставить("Масштабировать", СтруктураШаблона.Масштабировать);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("СохранятьПропорции") Тогда
							ПараметрыШтрихкода.Вставить("СохранятьПропорции", СтруктураШаблона.СохранятьПропорции);
						КонецЕсли;
						Если СтруктураШаблона.Свойство("ВертикальноеВыравнивание") Тогда
							ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание", СтруктураШаблона.ВертикальноеВыравнивание);
						КонецЕсли;
						
						// ТУ Алфимов 01.03.2024++
						//Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
						
						Рисунок.Картинка = ИзображениеШтрихкода(ПараметрыШтрихкода);
						// ТУ Алфимов 01.03.2024--
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Прошин_ТУ_19.05.23++
			
			//Для Счетчик = 1 По КоличествоКопий  Цикл
			//	//Область.ВысотаСтраницы = пСтрока.ВысотаЭтикетки;
			//	//Область.ШиринаСтраницы = пСтрока.ШиринаЭтикетки; 
			//	ТабличныйДокумент.Вывести(Область); 
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 				
			//КонецЦикла;     
			
			Для Счетчик = 1 По КоличествоКопий  Цикл
				ТабличныйДокумент.РазмерСтраницы = "Custom";
				ТабличныйДокумент.ВысотаСтраницы = пСтрока.Шаблон.ВысотаЭтикетки;
				ТабличныйДокумент.ШиринаСтраницы = пСтрока.Шаблон.ШиринаЭтикетки;
				ТабличныйДокумент.Вывести(Область); 
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 				
			КонецЦикла; 
			// Прошин_ТУ_19.05.23--

			
		КонецЦикла;	
		
	КонецЦикла;	
КонецФункции

Функция СформироватьТабличныйДокументЭтикеткиСерииПоШаблону(СерииДляПечати, КоличествоКопий = 1, ТабличныйДокумент, Принтер=Неопределено)
	
	// ТУ_Самойленко 30.08.23 ++
	ПолученыПараметрыПечати = Ложь;
	Если Принтер <> Неопределено Тогда
		ПараметрыПечати = ПолучитьПараметрыПринтера(Принтер);
		ПолученыПараметрыПечати = Истина;
	КонецЕсли;
	// ТУ_Самойленко 30.08.23 --
	
	ТаблицаПечати = Новый ТаблицаЗначений;
	ТаблицаПечати.Колонки.Добавить("РеквизитыСерии");
	ТаблицаПечати.Колонки.Добавить("Штрихкод");	
	
	Для каждого РеквизитыСерии Из СерииДляПечати  Цикл	
		нСтрока = ТаблицаПечати.Добавить(); 
		нСтрока.РеквизитыСерии = РеквизитыСерии;
		нСтрока.Штрихкод = вмс_СерииТоваровСервер.СформироватьШтрикходСерии(РеквизитыСерии);		
	КонецЦикла;  
	
	Макет = ПолучитьОбщийМакет("МакетШтрихкода"); 
	
	// ТУ_Самойленко 30.08.23 ++
	Если ПолученыПараметрыПечати Тогда
		ШиринаЭтикетки = ПараметрыПечати.ШиринаЭтикетки;
		ВысотаЭтикетки = ПараметрыПечати.ВысотаЭтикетки;
		РазмерШрифта = ПараметрыПечати.РазмерШрифта;
	Иначе
		ШиринаЭтикетки = 50;
		ВысотаЭтикетки = 50;
		РазмерШрифта = Окр(ВысотаЭтикетки * 0.4);
	КонецЕсли;
	// ТУ_Самойленко 30.08.23 --
	
	Для каждого ДанныеПечати Из ТаблицаПечати Цикл 
			
		ЗначениеШтрихкода = ДанныеПечати.Штрихкод;  
		Шаблон = Макет.ПолучитьОбласть("ОбластьШтрихкода"); 
		
		УстановитьБазовыеПараметрыТабличногоДокумента(Шаблон);
		
		Эталон = ПолучитьОбщийМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;  //0.26454
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(ШиринаЭтикетки / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр((ВысотаЭтикетки - 2) / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь); 
		ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
		ПараметрыШтрихкода.Вставить("ТипКода", 16);
		ПараметрыШтрихкода.Вставить("УбратьЛишнийФон", Истина);
		
		
		// ТУ Алфимов 01.03.2024++
		//Шаблон.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		
		Шаблон.Рисунки.Штрихкод.Картинка = ИзображениеШтрихкода(ПараметрыШтрихкода);
		// ТУ Алфимов 01.03.2024--
		
		Шаблон.Рисунки.Штрихкод.Высота = 1; 
		Шаблон.Рисунки.Штрихкод.Ширина = ШиринаЭтикетки;    
		
		Шаблон.Параметры.ПредставлениеКода = ЗначениеШтрихкода;		
		Шаблон.ТекущаяОбласть.Шрифт = Новый Шрифт(Шаблон.ТекущаяОбласть.Шрифт,,РазмерШрифта,Истина);   
		
		ОбластьПредставления = Шаблон.Область(1,1,1,Шаблон.ШиринаТаблицы);
		ОбластьПредставления.Объединить(); 
		ОбластьПредставления.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		
		КартинкаШтрихкода = Шаблон.Рисунки.Штрихкод;
		// Сохраним размеры штрихкода
		ВысотаКартинки = КартинкаШтрихкода.Высота;
		ШиринаКартинки = КартинкаШтрихкода.Ширина;
		ВерхКартинки = КартинкаШтрихкода.Верх; 
		ЛевоКартинки = КартинкаШтрихкода.Лево;
		КартинкаШтрихкода.Расположить(ОбластьПредставления);
		// Сохраним размеры штрихкода	
		НоваяШирина = КартинкаШтрихкода.Ширина; 
		НоваяВысота = ВысотаЭтикетки - КартинкаШтрихкода.Высота;		
		Разница = (НоваяШирина - ШиринаКартинки) / 2; 
		ВеличинаСдвигаКартинкиНаТекст = КартинкаШтрихкода.Высота / 5; // рассчитаем место, куда можно задвинуть картинку, потому что текст центрирован, внизу есть место
		КартинкаШтрихкода.Верх = ВерхКартинки - ВеличинаСдвигаКартинкиНаТекст; //задвинем картинку на текст
		КартинкаШтрихкода.Высота = НоваяВысота + (ВеличинаСдвигаКартинкиНаТекст - 4); // ТУ_Самойленко 30.08.23 Заменил +4 на -4
		КартинкаШтрихкода.Ширина = ШиринаКартинки;
		КартинкаШтрихкода.Лево = ЛевоКартинки + Разница;	
		КартинкаШтрихкода.РазмерКартинки = РазмерКартинки.Пропорционально; // ТУ_Самойленко 30.08.23 Убрал реальный размер, т.к. при увеличении размера этикетки, она не полностью отображается.
		
		Для Счетчик = 1 По КоличествоКопий  Цикл 
			ТабличныйДокумент.РазмерСтраницы = "Custom";
			ТабличныйДокумент.ВысотаСтраницы = ВысотаЭтикетки;
			ТабличныйДокумент.ШиринаСтраницы = ШиринаЭтикетки;
			ТабличныйДокумент.Вывести(Шаблон);   
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
	КонецЦикла; 
		
	
КонецФункции

#КонецОбласти
